{
    "1": [
        {
            "name": "Конвертер валют",
            "description": " Легка програма, завдяки якій ви освоїтесь в роботі з API. Ви можете розробити як консольну версію, так і трохи покреативити з створенням графічного дизайну"
        },
        {
            "name": "ToDo list",
            "description": "Або ж іншими словами список справ. Це стандартна програма для багатьох початківців. Під час її виконання ви ознайомитесь з файловою системою, навчитесь зберігати, обробляти та видаляти інформацію, яку вводить користувач"
        }
    ],
    "2": [
        {
            "name": "Конвертер валют",
            "description": " Легка програма, завдяки якій ви освоїтесь в роботі з API. Ви можете розробити як консольну версію, так і трохи покреативити з створенням графічного дизайну"
        },
        {
            "name": "Додаток для керування персоналом",
            "description": "Створіть систему для керування персоналом компанії, де будуть функції, такі як керування вакансіями, робочими змінами та зарплатами. Використовуйте Java на бекенді та фреймворки для створення користувацького інтерфейсу."
        }
    ],
    "3": [
        {
            "name": "Конвертер валют",
            "description": " Легка програма, завдяки якій ви освоїтесь в роботі з API. Ви можете розробити як консольну версію, так і трохи покреативити з створенням графічного дизайну"
        },
        {
            "name": "Система управління завданнями (Task Management)",
            "description": "Створіть додаток для керування списком завдань, використовуючи .NET на бекенді (наприклад, ASP.NET Core) та технології, такі як Angular або React для фронтенду. Забезпечте можливість створювати, редагувати, видаляти та відстежувати завдання."
        }
    ],
    "4": [
        {
            "name": "Додаток з графічним інтерфейсом",
            "description": "Створіть додаток з графічним інтерфейсом за допомогою Qt. Може бути щось просте, наприклад, калькулятор або додаток для зображень, або ж більш складне - редактор тексту або малювання."
        },
        {
            "name": "Таймер",
            "description": "Розробіть таймер з графічним інтерфейсом, що має можливість встановлювати час, запускати та зупиняти його. Додайте звукові сигнали для певних подій, наприклад, закінчення відліку."
        }
    ],
    "5": [
        {
            "name": "Веб-розробка на Flask або Django",
            "description": "Чудовою ідеєю, щоб здобути нові знання, які ще й можна застосувати на практиці, є створення веб-застосунку на фреймворках Python, в останні роки найпопулярнішими є Flask i Django. З ними ви можете зробити багато цікавого: від особистого блогу до соцмережі чи маркет-плейсу."
        },
        {
            "name": "Конвертер валют",
            "description": " Легка програма, завдяки якій ви освоїтесь в роботі з API. Ви можете розробити як консольну версію, так і трохи покреативити з створенням графічного дизайну"
        },
        {
            "name": "Телеграм бот",
            "description": "Телеграм-боти дедалі більше входять в наше життя, ними починають цікавитись навіть великі компанії як Lifecell, Львівобленерго, Yakaboo. З телеграм ботами ви можете як спростити собі життя, так і урізноманітнити його цікавими рішеннями та забавками. Для розробки зараз найчастіше використовують Aiogram i Telebot. Телебот простіший, але сучасним стандартом є саме Aiogram, тому ми рекомендуємо почати з нього"
        },
        {
            "name": "ToDo list",
            "description": "Або ж іншими словами список справ. Це стандартна програма для багатьох початківців. Під час її виконання ви ознайомитесь з файловою системою, навчитесь зберігати, обробляти та видаляти інформацію, яку вводить користувач"
        }
    ],
    "6": [
        {
            "name": "Сторінка-візитка",
            "description": "Зверстайте свій сайт-візитівку. Так ви попрактикуєтесь в роботі з HTML i CSS, спробуєте себе в дизайні та краще зрозумієте, як працювати в цій сфері"
        },
        {
            "name": "Інтерактивна карта",
            "description": "Спробуйте попрацювати з API інших сервісів, додавши на свою сторінку карту. Так ви попрактикуєтесь в роботі з HTML i CSS, а також спробуєте попрацювати з JavaScript, який є однією з основних мов для фронтенду"
        }
    ],
    "7": [
        {
            "name": "Веб-розробка",
            "description": "Чудовою ідеєю, щоб здобути нові знання, які ще й можна застосувати на практиці, є створення веб-застосунку від особистого блогу до соцмережі чи маркет-плейсу, у цьому вам допоможуть такі фреймворки як Angular i NodeJS"
        },
        {
            "name": "Конвертер валют",
            "description": " Легка програма, завдяки якій ви освоїтесь в роботі з API. Ви можете розробити як консольну версію, так і трохи покреативити з створенням графічного дизайну"
        },
        {
            "name": "Телеграм бот",
            "description": "Телеграм-боти дедалі більше входять в наше життя, ними починають цікавитись навіть великі компанії як Lifecell, Львівобленерго, Yakaboo. З телеграм ботами ви можете як спростити собі життя, так і урізноманітнити його цікавими рішеннями та забавками"
        },
        {
            "name": "ToDo list",
            "description": "Або ж іншими словами список справ. Це стандартна програма для багатьох початківців. Під час її виконання ви ознайомитесь з файловою системою, навчитесь зберігати, обробляти та видаляти інформацію, яку вводить користувач"
        }
    ],
    "8": [
        {
            "name": "Веб-розробка",
            "description": "Чудовою ідеєю, щоб здобути нові знання, які ще й можна застосувати на практиці, буде розробка веб-застосунку. Ви краще зрозумієте принцип роботи програми, а тоді зможете запустити її на певному хостингу, навчившись працювати з серверами"
        },
        {
            "name": "Телеграм бот",
            "description": "Телеграм-боти дедалі більше входять в наше життя, ними починають цікавитись навіть великі компанії як Lifecell, Львівобленерго, Yakaboo. З телеграм ботами ви можете як спростити собі життя, так і урізноманітнити його цікавими рішеннями та забавками. Після цього ви зможете залити бота на хостинг, щоб він міг працювати не тільки на вашій робочій машині"
        }
    ],
    "9": [
        {
            "name": "Тестування API",
            "description": "Створіть проект, де ви будете тестувати API різних веб-сервісів. Використовуйте бібліотеки, такі як Requests (Python) або RestAssured (Java) для створення запитів та перевірки відповідей сервера."
        },
        {
            "name": "Тестування баз даних",
            "description": "Створіть проект, де ви будете тестувати взаємодію програми з базою даних. Використовуйте SQL-запити для вставки, оновлення та видалення даних, а також для перевірки цілісності даних."
        }
    ],
    "10": [
        {
            "name": "Аутентифікація та авторизація",
            "description": "Вивчайте методи аутентифікації та авторизації на Node.js. Спробуйте реалізувати систему реєстрації та входу користувачів, а також механізм контролю доступу до деяких ресурсів."
        },
        {
            "name": "ToDo list",
            "description": "Або ж іншими словами список справ. Це стандартна програма для багатьох початківців. Під час її виконання ви ознайомитесь з файловою системою, навчитесь зберігати, обробляти та видаляти інформацію, яку вводить користувач"
        }
    ],
    "11": [
        {
            "name": "Міні-блог на мові Go",
            "description": "Створення міні-блогу з використанням фреймворку Gin або Echo, які забезпечують просту реалізацію веб-додатків на мові Go. Міні-блог може дозволяти користувачам створювати записи, редагувати, видаляти їх та переглядати записи інших користувачів."
        },
        {
            "name": "Конвертер валют",
            "description": "Створення консольного інструмента для конвертації валют з використанням відкритого API курсів валют. Користувач може вводити суму та обрати дві валюти, і програма покаже еквівалентну суму у другій валюті."
        },
        {
            "name": "Простий веб-сервер",
            "description": "Створення простого веб-сервера з використанням пакету net/http мови Go. Проєкт може містити кілька статичних HTML сторінок і зображень. Ви можете також розробити кілька API-точок, які обслуговують запити від клієнтів."
        }
    ],
    "12": [
        {
            "name": "Годинник світового часу",
            "description": "Створіть додаток для Android, який відображає час у різних містах світу. Користувач може обирати міста зі списку або додавати нові. Додаток має отримувати часові дані з інтернету за допомогою API і відображати їх в зручному для користувача форматі."
        },
        {
            "name": "Записувач голосу",
            "description": "Створіть додаток для запису та зберігання аудіозаписів. Додаток може мати можливість надіслати аудіозаписи електронною поштою або через месенджери. Також можна додати можливість встановлення тегів та зберігання додаткової інформації про кожен запис."
        },
        {
            "name": "Додаток з картами та навігацією",
            "description": "Створіть додаток з інтерактивною картою, що відображає місцезнаходження користувача. Додаток може також надавати можливість вибрати пункт призначення, розрахувати маршрут та показати кращий спосіб досягти мети, використовуючи API для навігації."
        }
    ],
    "13": [
        {
            "name": "Соціальна мережа",
            "description": "Створення повноцінної соціальної мережі, яка включає функції реєстрації та входу користувачів, створення та редагування профілю, додавання друзів, публікацію повідомлень і медіафайлів, коментування та вподобання записів. Використовуйте фреймворки, такі як React або Angular для фронтенду, а для бекенду можна використовувати Node.js або Django."
        },
        {
            "name": "Інтернет-магазин",
            "description": "Розробіть онлайн-магазин з можливістю переглядати товари, додавати їх у кошик, здійснювати замовлення та оплату. Додайте також панель адміністратора для управління товарами, замовленнями та іншими елементами магазину. Використовуйте фреймворки та бібліотеки, такі як React, Vue або Angular для фронтенду, а для бекенду можна використовувати Node.js або Ruby on Rails."
        },
        {
            "name": "Подкаст платформа",
            "description": "Розробіть веб-додаток для подкастів, де користувачі можуть слухати, вподобати та коментувати подкастові випуски. Додайте можливість створювати та завантажувати свої власні подкасти. Використовуйте фреймворки та бібліотеки, такі як React, Angular або Laravel для фронтенду, а для бекенду можна використовувати Node.js або Django."
        }
    ],
    "14": [
        {
            "name": "Резервне копіювання та відновлення баз даних",
            "description": "Розробіть автоматизований процес резервного копіювання баз даних PostgreSQL та відновлення з них. Використовуйте інструменти, такі як pg_dump та pg_restore, для створення та відновлення резервних копій. Додайте графічний інтерфейс або командний рядок для вибору бази даних, планування резервних копій та відновлення з резервних файлів."
        },
        {
            "name": "Оптимізація продуктивності баз даних",
            "description": "Оптимізуйте продуктивність баз даних PostgreSQL, використовуючи індексацію, матеріалізовані види (materialized views), оптимізовані запити та інші методи. Аналізуйте плани виконання запитів для виявлення можливостей оптимізації та покращення швидкодії. Створіть звіти з рекомендаціями щодо оптимізації та впроваджуйте їх."
        },
        {
            "name": "Безпека баз даних",
            "description": "Забезпечте безпеку баз даних PostgreSQL, встановивши належні права доступу, шифруючи дані, використовуючи SSL-з'єднання, використовуючи механізми аутентифікації та інші методи безпеки. Розробіть процедури для регулярного оновлення паролів, відстеження вразливостей та аудиту доступу."
        }
    ],
    "15": [
        {
            "name": "Децентралізований гаманець для криптовалют",
            "description": "Розробіть додаток для зберігання і керування криптовалютами. Додаток повинен бути децентралізованим, що означає, що користувачі мають повний контроль над своїми приватними ключами та активами. Використайте технологію блокчейн для забезпечення безпеки і надійності транзакцій."
        },
        {
            "name": "Децентралізований аукціон",
            "description": "Розробіть додаток для проведення аукціонів, де користувачі можуть ставити ставки на активи, використовуючи криптовалюти. Всі ставки та транзакції повинні бути записані в блокчейні для прозорості та недоступності маніпуляцій."
        },
        {
            "name": "Децентралізована платформа для смарт-контрактів",
            "description": "Розробіть платформу для створення та виконання смарт-контрактів на базі технології блокчейн. Смарт-контракти повинні бути незмінними та автономними, щоб забезпечити безпеку та недоступність маніпуляцій."
        }
    ],
    "16": [
        {
            "name": "Перехід до хмарної архітектури",
            "description": "Розробіть план переходу існуючого монолітного додатка до хмарної архітектури. Виберіть хмарний провайдер (наприклад, AWS, Azure або GCP) та розробіть архітектурний дизайн для міграції. Перенесіть окремі компоненти до контейнерів Docker та використовуйте оркестратор Kubernetes для керування."
        },
        {
            "name": "Архітектура розподіленої системи IoT",
            "description": "Створіть архітектурний дизайн для розподіленої системи Інтернету речей (IoT), яка об'єднує сенсори та пристрої для збору даних. Розгляньте питання забезпечення безпеки, ефективного обміну даними та аналізу масивних обсягів інформації."
        },
        {
            "name": "Архітектура блокчейн додатка",
            "description": "Розробіть архітектурний дизайн для додатка на базі технології блокчейн. Виберіть тип блокчейн (приватний або публічний), оберіть механізм консенсусу (Proof of Work, Proof of Stake тощо) та спроектуйте смарт-контракти для необхідного функціоналу."
        },
        {
            "name": "Аналіз та оцінка існуючої архітектури",
            "description": "Проаналізуйте та оцініть існуючу архітектуру програмного проекту. Виявіть потенційні проблеми та недоліки, а також запропонуйте вдосконалення та оптимізації. Заплануйте процес поступової модернізації або реорганізації системи."
        }
    ],
    "17": [
        {
            "name": "Дизайн мобільного додатка для здоров'я та фітнесу",
            "description": "Створіть дизайн мобільного додатка, що допомагатиме користувачам вести здоровий спосіб життя та займатися фітнесом. Розробіть інтуїтивний та привабливий інтерфейс, який дозволить користувачам легко вводити свої дані про їжу, фізичні навантаження та медичні показники. Додайте можливість встановлення цілей та моніторингу прогресу."
        },
        {
            "name": "Дизайн онлайн-платформи для навчання",
            "description": "Розробіть дизайн онлайн-платформи для навчання, яка забезпечує зручний та ефективний досвід для учнів. Розгляньте навігацію, організацію вмісту та інтерактивні елементи, що покращать залучення та зрозумілість для користувачів. Забезпечте простоту процесу реєстрації та доступу до матеріалів навчання."
        },
        {
            "name": "Дизайн веб-сервісу для онлайн-покупок",
            "description": "Розробіть дизайн веб-сервісу для інтернет-магазину, який забезпечить зручність та задоволення користувачам під час покупок. Зосередьте увагу на удосконаленні процесу пошуку та фільтрації товарів, швидкості оформлення замовлення та простоті оплати. Забезпечте зручний профіль користувача для збереження історії покупок та відстеження стану доставки."
        },
        {
            "name": "Дизайн креативного портфоліо для художника або дизайнера",
            "description": "Створіть дизайн креативного та вражаючого портфоліо для художника, дизайнера або фотографа. Розгляньте оригінальний макет та організацію робіт у портфоліо таким чином, щоб вони залучали та підкреслювали навички та стиль автора."
        },
        {
            "name": "Дизайн додатку для путівників та подорожей",
            "description": "Розробіть дизайн додатку для путівників, який надає користувачам детальну інформацію про місцеві пам'ятки, маршрути, ресторани та готелі. Забезпечте зручну картографію, можливість збереження попередньої інформації офлайн та спільний доступ до досвіду місцевих жителів."
        },
        {
            "name": "Дизайн додатку для збереження ймовірних небезпек на дорозі",
            "description": "Створіть дизайн додатку, який допоможе водіям попереджати про можливі небезпеки на дорозі, такі як дорожні ремонти, затори або небезпечні умови погоди. Забезпечте інтерактивність для користувачів, які можуть додавати та перевіряти інформацію про дорожні умови у реальному часі."
        }
    ]
}